OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantBoussinesqPenaltySimpleFoam/cases/solid_fluid_cht/system/blockMeshDict

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

verbose no;
scale 0.001;

x0 -31;
x1 -11;
x2 11;
x3 51;

y0 0;
y1 10;
y2 -3;

z0  8.25;
z1 -8.25;
z2  2;
z3 -2;

vertices
(
  ($x0 $y0 $z0)   // 0
  ($x1 $y0 $z0)   // 1
  ($x2 $y0 $z0)   // 2
  ($x3 $y0 $z0)   // 3
//
  ($x0 $y1 $z0)   // 4
  ($x1 $y1 $z0)   // 5
  ($x2 $y1 $z0)   // 6
  ($x3 $y1 $z0)   // 7
//
  ($x1 $y2 $z0)   // 8
  ($x2 $y2 $z0)   // 9
//////
  ($x0 $y0 $z2)   // 10
  ($x1 $y0 $z2)   // 11
  ($x2 $y0 $z2)   // 12
  ($x3 $y0 $z2)   // 13
//
  ($x0 $y1 $z2)   // 14
  ($x1 $y1 $z2)   // 15
  ($x2 $y1 $z2)   // 16
  ($x3 $y1 $z2)   // 17
//
  ($x1 $y2 $z2)   // 18
  ($x2 $y2 $z2)   // 19
//////
  ($x0 $y0 $z3)   // 20
  ($x1 $y0 $z3)   // 21
  ($x2 $y0 $z3)   // 22
  ($x3 $y0 $z3)   // 23
//
  ($x0 $y1 $z3)   // 24
  ($x1 $y1 $z3)   // 25
  ($x2 $y1 $z3)   // 26
  ($x3 $y1 $z3)   // 27
//
  ($x1 $y2 $z3)   // 28
  ($x2 $y2 $z3)   // 29
//////
  ($x0 $y0 $z1)   // 30
  ($x1 $y0 $z1)   // 31
  ($x2 $y0 $z1)   // 32
  ($x3 $y0 $z1)   // 33
//
  ($x0 $y1 $z1)   // 34
  ($x1 $y1 $z1)   // 35
  ($x2 $y1 $z1)   // 36
  ($x3 $y1 $z1)   // 37
//
  ($x1 $y2 $z1)   // 38
  ($x2 $y2 $z1)   // 39
);

lvl 1;

blocks
(
    hex (0 1 11 10 4 5 15 14)   fluid  ( 20 16 10 ) simpleGrading (1 1 1)
    hex (1 2 12 11 5 6 16 15)   fluid  ( 22 16 10 ) simpleGrading (1 1 1)
    hex (2 3 13 12 6 7 17 16)   fluid  ( 40 16 10 ) simpleGrading (1 1 1)
    hex (8 9 19 18 1 2 12 11)   solid  ( 22 16  3 ) simpleGrading (1 1 1)
//
    hex (10 11 21 20 14 15 25 24)   fluid  ( 20 16 10 ) simpleGrading (1 1 1)
    hex (11 12 22 21 15 16 26 25)   solid  ( 22 16 10 ) simpleGrading (1 1 1)
    hex (12 13 23 22 16 17 27 26)   fluid  ( 40 16 10 ) simpleGrading (1 1 1)
    hex (18 19 29 28 11 12 22 21)   solid  ( 22 16  3 ) simpleGrading (1 1 1)
//
    hex (20 21 31 30 24 25 35 34)   fluid  ( 20 16 10 ) simpleGrading (1 1 1)
    hex (21 22 32 31 25 26 36 35)   fluid  ( 22 16 10 ) simpleGrading (1 1 1)
    hex (22 23 33 32 26 27 37 36)   fluid  ( 40 16 10 ) simpleGrading (1 1 1)
    hex (28 29 39 38 21 22 32 31)   solid  ( 22 16  3 ) simpleGrading (1 1 1)
);

defaultPatch
{
    name    walls;
    type    wall;
}

boundary
(
    inlet
    {
      type            patch;
    
      faces
      (
        ( 0 10 14  4)
        (10 20 24 14)
        (20 30 34 24)
      );
    }

    outlet
    {
      type            patch;
    
      faces
      (
        ( 7  3 13 17)
        (17 13 23 27)
        (27 23 33 37)
      );
    }

    bottom
    {
      type            patch;
    
      faces
      (
        ( 8  9 19 18)
        (18 19 29 28)
        (28 29 39 38)
      );
    }
);

// ************************************************************************* //
