OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/passive/buoyantBoussinesqPenaltySimpleFoam/cases/solid_fluid_cht/system/fluid/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    optCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (-5.5e-3 -1 -1) (5.5e-3 1 1);
        //box     (-1 -1 -1) (1 1 1);
    }
    {
        name    optZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     optCells;
    }
);

// ************************************************************************* //
